# Homebrew Bundle Brewfile
# Usage: brew bundle install (or brew bundle install --file=~/dotfiles/Brewfile)

tap "homebrew/cask"

# 言語・ランタイム
brew "go"
brew "ruby"
brew "python@3.14"
brew "node"
brew "openjdk@21"

# 開発ツール
brew "git"
brew "docker"
brew "docker-compose"
brew "neovim"
brew "rustup-init"

# CLI ツール
brew "ripgrep"      # rg - 高速検索
brew "fd"           # fd - find の高速代替
brew "bat"          # bat - cat の高機能版
brew "eza"          # eza - ls の高速代替
brew "starship"     # starship - プロンプト

# 開発ユーティリティ
brew "php"
brew "thefuck"      # コマンド修正ツール

# オプション（後で追加可能）
# brew "postgresql"
# brew "mysql"
# brew "redis"
